Revit 2024 API
JournalingAttribute.Mode Property
Journaling mode.
Namespace: Autodesk.Revit.Attributes
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public JournalingMode Mode { get; }
Visual Basic
Public ReadOnly Property Mode As JournalingMode
	Get
Visual C++
public:
property JournalingMode Mode {
	JournalingMode get ();
}
See Also
JournalingAttribute Class
Autodesk.Revit.Attributes Namespace